docs: review of all the docs
